<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"0f37db8b0b86af576df0f507412ad4970b3aa282f58f52e4be3cbd043eaf2ce3","plan_job_ref":"Job Plan Airflow DAGs #466 at https://github.com/cal-itp/data-infra/actions/runs/16917973610","plan_out_hash":"466bda6afb2e209ee3d5c1f231715b013b313660f05675dc786c9cf7877f64f9","plan_hash":"783597544b30197941075da64f32da70907061302b90737b29b4e8b733dec0ef","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 1 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["plugins/operators/kuba_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "LSEXnQ==" -> (known after apply)
!~      detect_md5hash      = "9KQQzOeKDNll1PwLoo4TOQ==" -> "different hash"
!~      generation          = 1752606164136368 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/kuba_to_gcs_operator.py"
!~      md5hash             = "9KQQzOeKDNll1PwLoo4TOQ==" -> (known after apply)
        name                = "plugins/operators/kuba_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/src/kuba_cleaner.py"] will be created
+   resource "google_storage_bucket_object" "calitp-composer" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "plugins/src/kuba_cleaner.py"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/plugins/src/kuba_cleaner.py"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "1cXZrQ==" -> (known after apply)
!~      detect_md5hash      = "5XTBJP44XspAaNiVytscxg==" -> "different hash"
!~      generation          = 1754957465387203 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "5XTBJP44XspAaNiVytscxg==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "aiyZeg==" -> (known after apply)
!~      detect_md5hash      = "9Ta7ieeRNCQ1uLJUCJHtJA==" -> "different hash"
!~      generation          = 1754957466994304 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "9Ta7ieeRNCQ1uLJUCJHtJA==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #466](https://github.com/cal-itp/data-infra/actions/runs/16917973610)